/** 有道翻译错误代码映射 */
export const errorMessage: Record<string, string> = {
  101: 'appKey参数为空',
  102: 'appSecret参数为空',
  103: '翻译文本过长',
  104: '不支持的语言类型',
  105: '不支持的签名类型',
  106: '不支持的响应类型',
  107: '不支持的传输加密类型',
  108: 'appKey无效',
  109: 'batchLog格式不正确',
  110: '无相关服务的有效实例',
  111: '开发者账号无效',
  201: '解密失败',
  202: '签名检验失败',
  203: '访问IP地址不在可访问IP列表',
  301: '辞典查询失败',
  302: '翻译查询失败',
  303: '服务端的其它异常',
  401: '账户已经欠费',
  411: '访问频率受限',
  412: '长请求过于频繁',
}

/** 错误消息键类型 */
export type ErrorMessageKey = keyof typeof errorMessage
